[
  {
    "title": "I Spent a Weekend Building What Tesla Won’t Tell Us",
    "date": "February 3, 2026",
    "subtitle": "AI is reshaping what projects are worth doing",
    "excerpt": "Is Tesla’s Robotaxi safer than a human driver? This should be a straightforward data question. But when I searched Google, nothing. Tesla’s website? Nothing. NHTSA reports? Scattered numbers that don’t connect to anything. News coverage? One day it’s “Robotaxi violated traffic laws,” the next it’s “NHTSA investigating,” then “Tesla filed confidential documents.” It shows the current miles per incident (107,500), the fleet size (232 vehicles), how fast safety is improving (doubling every 69 days), and how far we are from matching human driving benchmarks. This project taught me something I hadn’t fully grasped before: AI isn’t just for answering questions. It’s for building things. The Shareholder’s Question June 22, 2025 was a day I’d been waiting for. After years of promises, Tesla’s Robo",
    "url": "https://kangninghuang.substack.com/p/i-spent-a-weekend-building-what-tesla",
    "coverImage": "https://substackcdn.com/image/fetch/$s_!KShx!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5c5933db-a1fc-4930-9a84-41c658673425_2486x1822.png",
    "wordcount": 1626
  },
  {
    "title": "Your Brain Wasn't Built to Babysit AI",
    "date": "January 20, 2026",
    "subtitle": "Why Ralph Loop Makes You More Productive, Not Just Your AI",
    "excerpt": "The Ralph Loop: Your Agent’s Nightmare, Your Sweet Dreams If you’ve been anywhere near tech Twitter lately, you’ve probably seen people talking about “Ralph Wiggum” like it’s a cheat code. The meme-y name doesn’t help. But the idea is real. The Hidden Trap of Working With AI On the surface, having AI do your work should make life easier. But here’s what actually happens: You ask AI to refactor a code module. It starts running. You wait. Five minutes pass. You think, might as well do something useful , so you jump to another project. Two minutes later, the first AI throws an error—context window overloaded, output quality tanked, needs your intervention. You switch back, spend a few minutes rebuilding mental context, make a decision, clean up the conversation history. AI starts running agai",
    "url": "https://kangninghuang.substack.com/p/your-brain-wasnt-built-to-babysit",
    "coverImage": "https://substackcdn.com/image/fetch/$s_!Cg1z!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b69ae97-be6c-499e-bc4f-02c1e69ea59b_1024x1024.png",
    "wordcount": 2002
  },
  {
    "title": "The Biggest Climate Paradox You’ve Never Heard Of: Urban Heat Saves More Lives Than It Takes",
    "date": "December 5, 2025",
    "subtitle": "Imagine a city on a freezing January morning.",
    "excerpt": "Imagine a city on a freezing January morning. The skyscrapers glow faintly in the dusk. The asphalt radiates back the heat it stored the day before. Downtown is a few degrees warmer than the outskirts. We’ve given this phenomenon a villain’s name: the Urban Heat Island . You already know the narrative. Cities are too hot. Urbanization worsens heat stress. Climate change turns concrete into a slow oven. All of that is true. But here’s the part almost no one knows— urban heat also saves lives . A lot of them. The core problem is not cooling—it’s static cooling . Cities cool themselves the same way year-round, even when the temperature swings across a massive deadly gap. But what if our approach was dynamic? Our study experimented with a seasonally adaptive albedo strategy : Higher albedo in ",
    "url": "https://kangninghuang.substack.com/p/the-biggest-climate-paradox-youve",
    "coverImage": "https://substackcdn.com/image/fetch/$s_!FAvl!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F20949b5c-e521-4d25-813e-4c3e187687d1_2816x1536.png",
    "wordcount": 681
  },
  {
    "title": "The Thermal Frontiers of AI",
    "date": "December 1, 2025",
    "subtitle": "The New Strategic Geography No One Is Pricing In",
    "excerpt": "In the 19th century, Shanghai and Hong Kong weren’t “cities.” Not in the eyes of the Qing dynasty. They were marshy edges of the empire—humid, flood-prone, agriculturally useless, and geopolitically irrelevant. They produced no grain, supplied no armies, and carried no symbolic mandate of heaven. In an agrarian worldview, they were worthless. In North America, the quiet contenders include rural Oregon , eastern Washington , Idaho’s hydropower belt , and the large hydro corridors of northern Québec and Labrador . These regions hold advantages that Silicon Valley simply cannot replicate: long-standing hydro infrastructure, industrial power rates far below those of major metros, and climates cold enough to reduce cooling demands dramatically. Northern Québec, for example, has historically str",
    "url": "https://kangninghuang.substack.com/p/the-thermal-frontiers-of-ai",
    "coverImage": "https://substackcdn.com/image/fetch/$s_!qlRI!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F680c87f5-c407-4732-975a-04429d45a802_1024x572.jpeg",
    "wordcount": 1093
  },
  {
    "title": "The Hidden Geometry of Inequality and Innovation",
    "date": "November 21, 2025",
    "subtitle": "Why too much inequality breaks society, but zero inequality breaks progress.",
    "excerpt": "Every society struggles with inequality. We fear it, debate it, legislate around it. We talk about the top 1%, the shrinking middle class, the bottom half left behind. But one thing almost nobody talks about is this: What if some inequality is not just unavoidable, but necessary—for progress itself? Not morally. Not politically. But technologically . There is a very deep reason hidden inside Wright’s Law—one of the most important principles in the history of innovation—that explains why. And Tesla’s story is the perfect place to see it. Thanks for reading! Subscribe for free to receive new posts and support my work. Wright’s Law: the gear that turns the future Wright’s Law says something beautifully simple: Every time cumulative production doubles, costs fall by a predictable percent. Airp",
    "url": "https://kangninghuang.substack.com/p/the-hidden-geometry-of-inequality",
    "coverImage": "https://substack-post-media.s3.amazonaws.com/public/images/e6eee9af-b44d-4056-b666-f770a349f20e_640x480.jpeg",
    "wordcount": 1171
  },
  {
    "title": "Why Bigger, Denser Cities Use Less Material Per Person",
    "date": "November 20, 2025",
    "subtitle": "The strange economics of concrete, steel, and human life",
    "excerpt": "A puzzle hiding in plain sight Imagine two cities. City A has one million people. City B has two million. Instinctively, we assume City B needs twice as much stuff: twice the buildings, twice the roads, twice the concrete, twice the everything. But when we actually measured the total mass of buildings, roads, and pavement across 3,000 cities worldwide , we found something weird. Doubling the population does not double the material. Thanks for reading! Subscribe for free to receive new posts and support my work. It only increases it by about 87% . In other words, the two-million city uses 6.5% less per person than the one-million city. (Detailed math: (200% – 187%) / 2 = 13% / 2 = 6.5%) That’s the puzzle. Why does a bigger city weigh less per human than a smaller one? The hidden pattern: ci",
    "url": "https://kangninghuang.substack.com/p/why-bigger-denser-cities-use-less",
    "coverImage": "https://substack-post-media.s3.amazonaws.com/public/images/ad1155e2-d235-4473-9338-ae01236c5d43_1484x1076.png",
    "wordcount": 819
  },
  {
    "title": "Wait, Purple is NOT Violet?",
    "date": "November 19, 2025",
    "subtitle": "The circularity nature of light perception",
    "excerpt": "Every university has its own color. I work at NYU, and NYU’s color is purple. Well, no. If you check our official website, this color is actually called “violet.” NYU Violet is our principal brand color. “What’s the difference?” you may ask, “they look the same to me.” After some diggings, I found something pretty deep. And it relates to the strange, circular way our brains perceive light. Simply put, these two colors are fundamentally different: one is a true color, and the other is an illusion . Thanks for reading! Subscribe for free to receive new posts and support my work. Violet is not just a name. It refers to a very specific slice of the spectrum (0.38-0.45 µm), a measurable wavelength of light. Purple, in contrast, has no single wavelength at all. It only appears when our eyes mix ",
    "url": "https://kangninghuang.substack.com/p/wait-purple-is-not-violet",
    "coverImage": "https://substackcdn.com/image/fetch/$s_!sz_k!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc57809d8-d88c-42e8-b72c-52eeb0de794b_300x300.jpeg",
    "wordcount": 607
  },
  {
    "title": "Can Tesla Robotaxi Solve Our Housing Crisis?",
    "date": "November 10, 2025",
    "subtitle": "For regulators: robotaxi expansion policy is also housing affordability policy",
    "excerpt": "Imagine a city where the biggest new source of housing isn’t on its outskirts, but hidden in plain sight: beneath our wheels. Robotaxis—autonomous ride-hailing fleets now being tested in places like San Francisco and Austin—could quietly rewrite the geography of affordability in the next decade. Not through new technology alone, but by freeing two of our scarcest urban resources: land and time. The Asphalt Problem For every car on the road, cities build up to eight parking spaces—driveways, lots, garages, and curbs waiting for idle machines. Add them up, and parking covers more land in some downtowns than housing does. In Arlington, Texas, nearly half the city center is just car storage. It’s as if we built an entire shadow city of asphalt whose only residents are Toyotas and Fords. In the",
    "url": "https://kangninghuang.substack.com/p/could-fleets-of-self-driving-cars",
    "coverImage": "https://substack-post-media.s3.amazonaws.com/public/images/c5682db5-6f89-453b-a36f-550480f1afba_1024x683.webp",
    "wordcount": 826
  },
  {
    "title": "When Cities Tear Down to Cool Down",
    "date": "November 10, 2025",
    "subtitle": " What We Learned from Demolishing Urban Slums",
    "excerpt": "Cities are heating up. As concrete replaces trees and air conditioners hum day and night, urban areas often become several degrees warmer than their surroundings — a phenomenon known as the urban heat island . In many parts of the world, the hottest neighborhoods are also the poorest. In China, urban slums or “urban villages” — dense, informal settlements that house millions of migrant workers — are among the city’s most heat-stressed areas. Their tightly packed buildings, lack of vegetation, and narrow alleys trap heat like an oven. Thanks for reading! Subscribe for free to receive new posts and support my work. Over the past two decades, many of these settlements have been demolished and rebuilt as part of large-scale urban renewal programs. The big question is: does this actually make c",
    "url": "https://kangninghuang.substack.com/p/when-cities-tear-down-to-cool-down",
    "coverImage": "https://substack-post-media.s3.amazonaws.com/public/images/621ff608-1272-4a65-aec8-64bcb89a1925_1024x1024.png",
    "wordcount": 822
  },
  {
    "title": "Can you have a burger with panda or lion meat?",
    "date": "November 9, 2025",
    "subtitle": "Of course not.",
    "excerpt": "Of course not. Pandas and lions are protected animals, and eating them would be both illegal and unethical. But in the not-so-distant future, it might be possible to recreate their meat without ever harming a single animal. How? Through a new technology called precision fermentation . Thanks for reading! Subscribe for free to receive new posts and support my work. From ancient beer to future meat Fermentation is one of humanity’s oldest biotechnologies. Long before we understood microbiology, we were already using microbes to do our bidding. Yeast turning grains into beer, bacteria souring milk into yogurt and cheese, and microbes preserving vegetables into kimchi. Fermentation is simply the art of letting tiny living organisms transform one set of molecules into another that we find delic",
    "url": "https://kangninghuang.substack.com/p/can-you-have-a-burger-with-panda",
    "coverImage": "https://substack-post-media.s3.amazonaws.com/public/images/bed1b6aa-3557-4f51-9eca-f2737be4eb11_984x1000.jpeg",
    "wordcount": 547
  }
]
